{
  "backend/main.mo": "Main Motoko actor for the gym tracker backend, defining data types (exercises, workouts, user profiles, recovery states) and an exercise library with workout generation and recovery tracking logic.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, describing their purpose, key features, and notable implementation details.",
  "frontend/DEPLOY_RETRY.md": "Deployment retry log documenting multiple build/deploy attempts with descriptions of critical backend fixes applied, primarily around Motoko filter syntax corrections and recovery state updates.",
  "frontend/index.html": "Root HTML entry point for the Gym Tracker PWA, including viewport meta tags, PWA manifest link, Apple touch icons, iOS splash screen media queries, and the React app mount point.",
  "frontend/public/manifest.json": "PWA manifest for Gym Tracker defining app name, display mode, theme colors, icon paths, and categories for installable web app support.",
  "frontend/src/App.tsx": "Root React component managing authentication state, page navigation between login/onboarding/dashboard/workout flows, and workout validation before passing generated workouts to child pages.",
  "frontend/src/components/BodyweightModal.tsx": "Modal dialog component for logging and updating the user's bodyweight, with input validation and profile update mutation via React Query.",
  "frontend/src/components/BottomNav.tsx": "Renders a fixed bottom navigation bar with five tabs (Home, Workout, Progress, History, Settings) and opens a SettingsModal when the Settings tab is tapped, with haptic vibration feedback on each tap.",
  "frontend/src/components/ExerciseChangeModal.tsx": "Dialog modal that fetches and displays alternative exercises for the same muscle group, allowing the user to swap the current exercise and recording the change via a backend mutation.",
  "frontend/src/components/Header.tsx": "Sticky app header displaying the FitTrack logo/title with Settings and Logout icon buttons; logout clears the Internet Identity session and React Query cache.",
  "frontend/src/components/ProfileLoadingScreen.tsx": "Empty file with no content or exports.",
  "frontend/src/components/PullToRefresh.tsx": "Wraps children with touch-event-based pull-to-refresh logic, showing an animated spinner indicator and triggering an async onRefresh callback when the pull threshold is reached.",
  "frontend/src/components/RecoveryHeatmap.tsx": "Displays a card with per-muscle-group recovery percentages and status badges fetched from the backend, with optional weighted leg subgroup averaging and skeleton loading states.",
  "frontend/src/components/SettingsModal.tsx": "Dialog modal for editing user profile settings (gender, bodyweight, weight unit, training frequency, dark mode, rest timers), saving changes to the backend and syncing the theme via next-themes.",
  "frontend/src/components/SplashScreen.tsx": "Full-screen animated splash screen shown on app load, displaying the Gym Tracker logo, name, and tagline with fade/zoom entrance animations.",
  "frontend/src/components/StatusBar.tsx": "Sticky top status bar that shows the current workout streak (with a flame icon) and today's formatted date.",
  "frontend/src/components/WorkoutShareModal.tsx": "A modal dialog component that generates a QR code and shareable link for a workout, supporting clipboard copy and native Web Share API.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendActor.ts": "An empty file with no content.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks and mutations for interacting with the backend, including user profile management, workout data fetching, and error handling utilities.",
  "frontend/src/hooks/useWakeLock.ts": "A React hook that manages the Screen Wake Lock API to prevent screen dimming, with automatic re-acquisition on visibility change and comprehensive error handling.",
  "frontend/src/index.css": "Global CSS file enforcing a dark-only Telegram-inspired theme with Tailwind, CSS custom properties for design tokens, iOS safe area support, and mobile-optimized typography.",
  "frontend/src/lib/profileCache.ts": "An empty file with no content.",
  "frontend/src/lib/sessionStorage.ts": "Provides utilities to save, load, clear, and check active workout sessions in sessionStorage, with a 24-hour expiry on stored state.",
  "frontend/src/lib/timestampUtils.ts": "Utility functions to detect, convert, validate, and format backend BigInt timestamps (nanoseconds or milliseconds) into human-readable date strings.",
  "frontend/src/lib/workoutPreviewSections.ts": "Builds ordered workout sections from a flat exercise list, enforcing a fixed muscle-group order (Chest→Back→Shoulders→Arms→Legs→Core) with Legs split into subsections.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page displaying workout history stats, recovery heatmap, streak, and navigation to new workout, history, and progress pages, with pull-to-refresh support.",
  "frontend/src/pages/HistoryPage.tsx": "History page showing a calendar of trained dates and a list of past workouts with volume and date formatting, supporting pull-to-refresh.",
  "frontend/src/pages/LoginPage.tsx": "Login page presenting the FitTrack branding, feature highlights, and an Internet Identity login button with loading state handling.",
  "frontend/src/pages/NewWorkoutPage.tsx": "Page that lets users select a workout type (Full Body, Upper Body, Lower Body) and triggers AI workout generation via mutation hooks, then passes the result to the parent via callback.",
  "frontend/src/pages/OnboardingPage.tsx": "Initial setup page that collects user profile data (gender, bodyweight, rest times, training frequency) and saves it via the useSaveCallerUserProfile mutation.",
  "frontend/src/pages/ProgressPage.tsx": "Displays muscle group recovery status and weekly training volume with color-coded progress indicators, supporting pull-to-refresh via React Query cache invalidation.",
  "frontend/src/pages/SharedWorkoutPage.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/WorkoutPreviewPage.tsx": "Shows a generated workout plan before starting, validates for duplicates and data integrity, and allows individual exercise swaps via a modal before proceeding to the session.",
  "frontend/src/pages/WorkoutSessionPage.tsx": "Full active workout session page managing per-set logging, rest timers, wake lock, PR detection, confetti animations, exercise swaps, and session persistence with save/restore support.",
  "frontend/src/types.ts": "Defines frontend-only TypeScript interfaces for exercises, workouts, set data, muscle recovery state, and related data structures used throughout the app.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (using CSS variables), border radii, box shadows, font sizes, and animation keyframes, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Project state tracking file (version 15) documenting the Workout Generator backend's current deployment status, known bugs (notably a Motoko filter syntax bug causing missing leg exercises), architectural notes, and pending fix/refactor action items."
}