{
  "backend/main.mo": "Main Motoko actor for the gym tracker backend, defining data types (exercises, workouts, user profiles, recovery states) and an exercise library with workout generation and recovery tracking logic.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, describing their purpose, key features, and notable implementation details.",
  "frontend/DEPLOY_RETRY.md": "Deployment retry log documenting multiple build/deploy attempts with descriptions of backend Motoko filter syntax fixes, recovery mode corrections, and workout generation improvements across versions.",
  "frontend/index.html": "Root HTML entry point for the Gym Tracker PWA, configuring viewport, PWA meta tags, Apple touch icons, iOS splash screens, and loading the React app via Vite.",
  "frontend/public/manifest.json": "PWA manifest for Gym Tracker defining app name, display mode, theme colors, icon assets, and categories for installable web app support.",
  "frontend/src/App.tsx": "Root React component managing authentication state, page navigation between all app screens, workout generation with validation, and bottom navigation rendering.",
  "frontend/src/components/BodyweightModal.tsx": "Modal dialog component for logging and updating the user's bodyweight and weight unit, with input validation and profile update mutation.",
  "frontend/src/components/BottomNav.tsx": "Renders a fixed bottom navigation bar with five tabs (Home, Workout, Progress, History, Settings) and opens a SettingsModal when the Settings tab is tapped, with haptic vibration feedback on each tap.",
  "frontend/src/components/ExerciseChangeModal.tsx": "Dialog modal that fetches and displays alternative exercises for the same muscle group, allowing the user to swap the current exercise and recording the change via a backend mutation.",
  "frontend/src/components/Header.tsx": "Sticky app header displaying the FitTrack logo/title with Settings and Logout icon buttons; logout clears the Internet Identity session and React Query cache.",
  "frontend/src/components/ProfileLoadingScreen.tsx": "Empty file with no content or exports.",
  "frontend/src/components/PullToRefresh.tsx": "Wraps children with touch-event-based pull-to-refresh logic, showing an animated spinner indicator and triggering an async onRefresh callback when the pull threshold is reached.",
  "frontend/src/components/RecoveryHeatmap.tsx": "Displays a card with per-muscle-group recovery percentages and status badges fetched via useGetRecoveryState, with optional weighted leg subgroup averaging and skeleton loading states.",
  "frontend/src/components/SettingsModal.tsx": "Dialog modal for editing user profile settings (gender, bodyweight, weight unit, training frequency, dark mode, rest timers), persisting changes to the backend and syncing the app theme.",
  "frontend/src/components/SplashScreen.tsx": "Full-screen animated splash screen showing the app logo, name 'Gym Tracker', and tagline with staggered fade/slide-in animations on a black background.",
  "frontend/src/components/StatusBar.tsx": "Sticky top status bar that displays the current workout streak (with a flame icon) and today's formatted date.",
  "frontend/src/components/WorkoutShareModal.tsx": "A modal dialog component that generates a QR code and shareable link for a workout, supporting clipboard copy and native Web Share API.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useBackendActor.ts": "An empty file with no content or exports.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing login/logout state via DFINITY's AuthClient with support for delegation identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks and mutations for interacting with the backend, including user profile, workouts, and exercises, with error classification and validation helpers.",
  "frontend/src/hooks/useWakeLock.ts": "A React hook that manages the Screen Wake Lock API to prevent screen dimming, with automatic re-acquisition on visibility change and comprehensive error handling.",
  "frontend/src/index.css": "Global CSS file enforcing a dark-only Telegram-inspired theme with Tailwind, CSS custom properties for design tokens, iOS safe area utilities, and mobile typography settings.",
  "frontend/src/lib/profileCache.ts": "An empty file with no content or exports.",
  "frontend/src/lib/sessionStorage.ts": "Provides utilities to save, load, clear, and check active workout sessions in sessionStorage, with a 24-hour expiry on stored state.",
  "frontend/src/lib/timestampUtils.ts": "Utility functions to detect, convert, validate, and format backend BigInt timestamps (nanoseconds or milliseconds) into human-readable date strings.",
  "frontend/src/lib/workoutPreviewSections.ts": "Builds ordered workout sections from a flat exercise list, enforcing a fixed muscle-group order (Chest→Back→Shoulders→Arms→Legs→Core) with Legs split into subsections.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page displaying workout stats, recovery heatmap, streak, and navigation to new workouts, history, and progress, with pull-to-refresh and bodyweight modal support.",
  "frontend/src/pages/HistoryPage.tsx": "History page showing a calendar of trained dates and a list of past workouts with formatted timestamps and volume, supporting pull-to-refresh.",
  "frontend/src/pages/LoginPage.tsx": "Login page presenting the FitTrack branding, feature highlights, and an Internet Identity login button with loading state handling.",
  "frontend/src/pages/NewWorkoutPage.tsx": "Page that lets users select a workout type (Full Body, Upper Body, Lower Body) and triggers AI workout generation via mutation hooks, then passes the result to the parent via callback.",
  "frontend/src/pages/OnboardingPage.tsx": "Initial setup form that collects user profile data (gender, bodyweight, weight unit, training frequency, rest times) and saves it via the useSaveCallerUserProfile mutation.",
  "frontend/src/pages/ProgressPage.tsx": "Displays muscle group recovery status and weekly training volume using data from recovery and volume query hooks, with pull-to-refresh support.",
  "frontend/src/pages/SharedWorkoutPage.tsx": "Empty file with no content or implementation.",
  "frontend/src/pages/WorkoutPreviewPage.tsx": "Shows a generated workout plan before starting, validates for duplicates and data integrity, and allows exercise swapping via a modal or full workout regeneration.",
  "frontend/src/pages/WorkoutSessionPage.tsx": "Active workout session page managing per-exercise set logging, rest timers, wake lock, PR detection with confetti, session persistence, and weight suggestion updates.",
  "frontend/src/types.ts": "Defines frontend-only TypeScript interfaces for core domain objects including Exercise, WorkoutExercise, RecoveryState, MuscleGroupVolume, and SetConfiguration.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (using CSS variables), border radii, shadows, font sizes, and animation keyframes, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Project state tracking file documenting active bugs (broken workout generation, invalid Motoko filter syntax using `.toLower()` instead of `Text.toLowercase()`), architectural notes, known issues, and pending fix/feature requests for the Motoko backend."
}