{
  "backend/main.mo": "Main backend actor defining types (Gender, WeightUnit, TrainingFrequency, Exercise, Workout, RecoveryState, UserProfile), an exercise library with 100+ exercises across muscle groups, and workout generation logic with access control integration.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including styling (Telegram dark theme), components (Header, SettingsModal, RecoveryHeatmap), pages (Dashboard, Workout, History, Progress), hooks (useQueries with React Query), and validation logic for workouts and recovery states.",
  "frontend/DEPLOY_RETRY.md": "Deployment retry log documenting seven attempts to fix critical backend filter syntax bugs (invalid .toLower() replaced with Text.toLowercase/Text.equal), test mode recovery adjustments, and Upper Body workout generation issues.",
  "frontend/index.html": "HTML entry point with PWA meta tags, manifest link, Apple touch icons, iOS splash screens, and viewport configuration for mobile-first standalone app experience.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata (name, icons, theme colors, display mode) for installable standalone fitness tracking application.",
  "frontend/src/App.tsx": "Main React app component managing authentication flow, page routing (login/onboarding/dashboard/workout/history/progress), workout state with comprehensive validation (empty checks, duplicates, malformed data), and bottom navigation integration.",
  "frontend/src/components/BodyweightModal.tsx": "Modal dialog component for logging and updating user bodyweight with unit selection (kg/lb), input validation (0-500 range), and profile mutation integration.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar component with five tabs (Home, Workout, Progress, History, Settings) that handles page navigation, haptic feedback, and opens a settings modal.",
  "frontend/src/components/ExerciseChangeModal.tsx": "Modal dialog for changing exercises that fetches alternative exercises by muscle group, records the change to backend, and notifies parent component of selection.",
  "frontend/src/components/Header.tsx": "App header with branding (FitTrack logo) and action buttons for settings and logout that clears authentication and query cache.",
  "frontend/src/components/ProfileLoadingScreen.tsx": "Empty component file with no content.",
  "frontend/src/components/PullToRefresh.tsx": "Touch-based pull-to-refresh component that detects downward swipe gestures at scroll top, shows animated refresh indicator, and triggers async refresh callback.",
  "frontend/src/components/RecoveryHeatmap.tsx": "Card component displaying muscle group recovery percentages with color-coded badges and progress bars, supporting optional weighted leg subgroup calculations.",
  "frontend/src/components/SettingsModal.tsx": "Settings modal dialog for editing user profile including gender, bodyweight, training frequency, dark mode, rest times, and muscle group rest intervals with validation and backend persistence.",
  "frontend/src/components/SplashScreen.tsx": "Full-screen splash screen with animated dumbbell icon and 'Gym Tracker' branding shown during app initialization.",
  "frontend/src/components/StatusBar.tsx": "Sticky top status bar displaying current workout streak with flame icon and today's date.",
  "frontend/src/components/WorkoutShareModal.tsx": "Modal component for sharing workouts via QR code, copy link, or native share API. Dynamically loads QRCode.js from CDN and generates a shareable URL for the workout.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance with authentication, creating an authenticated or anonymous actor based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendActor.ts": "Empty file with no content.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend data operations including user profiles, workouts, exercises, and recovery state. Includes error handling utilities for auth, validation, and delegation expiry errors.",
  "frontend/src/hooks/useWakeLock.ts": "React hook for managing Screen Wake Lock API to prevent screen dimming, with automatic re-acquisition on visibility change, error handling, and browser support detection.",
  "frontend/src/index.css": "Global Tailwind CSS styles with Telegram 2025 dark theme colors enforced globally, including mobile optimizations for iOS safe areas, tap targets, and native-style transitions.",
  "frontend/src/lib/profileCache.ts": "Empty file with no content.",
  "frontend/src/lib/sessionStorage.ts": "Provides utilities to save, load, clear, and check for active workout sessions in sessionStorage, with a 24-hour expiration policy to prevent data loss on browser reload.",
  "frontend/src/lib/timestampUtils.ts": "Converts backend timestamps from nanoseconds to milliseconds, validates timestamp ranges, and provides formatting functions for displaying dates and times.",
  "frontend/src/lib/workoutPreviewSections.ts": "Builds ordered workout sections from exercises, enforcing a specific muscle group order (Chest, Back, Shoulders, Arms, Legs, Core) with Legs containing subsections for Quads, Hamstrings, Glutes, and Calves.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard displaying user stats, workout streak, recent workouts, recovery heatmap, and navigation to start new workouts or view history/progress. Includes pull-to-refresh and bodyweight modal functionality.",
  "frontend/src/pages/HistoryPage.tsx": "Displays workout history with a calendar view showing trained dates and a list of past workouts with details like type, volume, and timestamp. Includes pull-to-refresh functionality.",
  "frontend/src/pages/LoginPage.tsx": "Landing page with branding and feature highlights that prompts users to authenticate using Internet Identity.",
  "frontend/src/pages/NewWorkoutPage.tsx": "Displays workout type selection cards (Full Body, Upper Body, Lower Body) with muscle group details and triggers workout generation via mutation hooks when a type is selected.",
  "frontend/src/pages/OnboardingPage.tsx": "Collects user profile data (gender, bodyweight, training frequency, rest times) through a form and saves it using the useSaveCallerUserProfile mutation hook.",
  "frontend/src/pages/ProgressPage.tsx": "Displays muscle group recovery percentages and weekly training volume with pull-to-refresh functionality, using recovery state and volume query hooks.",
  "frontend/src/pages/SharedWorkoutPage.tsx": "Empty file with no content.",
  "frontend/src/pages/WorkoutPreviewPage.tsx": "Shows generated workout exercises organized by sections with validation checks for duplicates and data integrity, allowing exercise changes and workout regeneration before starting the session.",
  "frontend/src/pages/WorkoutSessionPage.tsx": "Manages active workout session with set-by-set logging, rest timers, wake lock, exercise changes, session persistence, and personal record tracking with particle animations.",
  "frontend/src/types.ts": "Defines frontend TypeScript interfaces for exercises, workouts, recovery states, muscle group volumes, and set configurations that extend backend types.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (HSL-based with CSS variables), extended border radii, shadows, font sizes, and keyframe animations for accordion components.",
  "project_state.json": "Project state tracking document showing Motoko workout-generator backend at v366 with known issues including invalid filter syntax (.toLower() vs Text.toLowercase) causing missing leg exercises and insufficient test-mode recovery offset; pending fixes in AR-5 through AR-8."
}