{
  "backend/main.mo": "Defines core workout types, recovery models, errors, user profiles, and provides a static exercise library for backend workout generation logic.",
  "feature_evidence.json": "Contains feature evidence metadata linking a deployment-trigger file to tests, components, and a recent backend workout filter fix.",
  "frontend-file-summaries.txt": "Provides high-level summaries of key frontend files including hooks, pages, components, and their behavior.",
  "frontend/DEPLOY_RETRY.md": "Documents deployment retry attempts and notes backend filter syntax fixes used to trigger rebuilds.",
  "frontend/index.html": "Base HTML document setting up PWA metadata, icons, splash screens, and root mount point.",
  "frontend/public/manifest.json": "Defines the PWA manifest with app metadata, icons, theme colors, and display configuration.",
  "frontend/src/App.tsx": "Main React app component handling authentication flow, profile checks, navigation, and workout validation.",
  "frontend/src/components/BodyweightModal.tsx": "Modal for updating bodyweight and units with validation, profile mutation, and vibration feedback.",
  "frontend/src/components/BottomNav.tsx": "Renders a bottom navigation bar with tabs and opens a settings modal. Handles navigation, vibration feedback, and active tab styling.",
  "frontend/src/components/ExerciseChangeModal.tsx": "Displays a modal listing alternative exercises and records selected exercise changes. Handles loading states, filtering, and backend mutation.",
  "frontend/src/components/Header.tsx": "Renders the app header with branding, test mode badge, settings button, and logout functionality. Clears cached data and handles logout errors.",
  "frontend/src/components/ProfileLoadingScreen.tsx": "Empty component file with no implementation.",
  "frontend/src/components/PullToRefresh.tsx": "Implements a custom pull‑to‑refresh interaction with touch tracking and refresh indicator animations. Calls a provided refresh function when threshold is met.",
  "frontend/src/components/RecoveryHeatmap.tsx": "Displays muscle recovery metrics with color coding, badges, and loading states. Supports weighted leg averages and fallback messages when no data exists.",
  "frontend/src/components/SettingsModal.tsx": "Provides a settings form for user profile fields, dark mode, and rest timers. Saves updates via backend mutations and validates inputs.",
  "frontend/src/components/SplashScreen.tsx": "Shows a full‑screen animated splash screen with app branding. Displays logo and tagline during initial load.",
  "frontend/src/components/StatusBar.tsx": "Shows a sticky status bar with the user's workout streak and today's date. Uses a flame icon to highlight streak progress.",
  "frontend/src/components/WorkoutShareModal.tsx": "Modal for sharing workouts that generates a QR code, copies the link, or triggers Web Share API.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBackendActor.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, login state, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks and helpers for backend interactions, error handling, and workout validation.",
  "frontend/src/hooks/useWakeLock.ts": "Hook to request and manage screen wake locks with auto‑reacquisition and error handling.",
  "frontend/src/index.css": "Global Tailwind‑based dark theme styles, typography, mobile optimizations, and safe‑area utilities.",
  "frontend/src/lib/profileCache.ts": "Empty file with no content.",
  "frontend/src/lib/sessionStorage.ts": "Provides utilities to save, load, validate, and clear workout session state in sessionStorage.",
  "frontend/src/lib/timestampUtils.ts": "Converts backend nanosecond timestamps to milliseconds and offers validation and formatting helpers.",
  "frontend/src/lib/workoutPreviewSections.ts": "Builds ordered workout sections by muscle group, including leg subsections and handling unexpected groups.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider wrappers.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main dashboard with workout history, recovery data, timestamp formatting, and refresh logic.",
  "frontend/src/pages/HistoryPage.tsx": "Displays workout history with date formatting, calendar integration, and refresh support.",
  "frontend/src/pages/LoginPage.tsx": "Shows login UI for Internet Identity with basic branding and feature highlights.",
  "frontend/src/pages/NewWorkoutPage.tsx": "UI for selecting a workout type and triggering workout generation via mutation hooks, then returning the generated exercises to the parent.",
  "frontend/src/pages/OnboardingPage.tsx": "Collects and validates user profile data, then saves it using a mutation and shows toast feedback.",
  "frontend/src/pages/ProgressPage.tsx": "Displays recovery state and weekly muscle group volume with refresh support and loading indicators.",
  "frontend/src/pages/SharedWorkoutPage.tsx": "Empty placeholder page with no implementation.",
  "frontend/src/pages/WorkoutPreviewPage.tsx": "Validates and displays a generated workout, supports regenerating the workout or changing individual exercises.",
  "frontend/src/pages/WorkoutSessionPage.tsx": "Manages live workout session flow including set logging, timers, PR detection, exercise changes, and saving session data.",
  "frontend/src/types.ts": "Defines frontend-specific types for exercises, workouts, recovery data, and set configurations.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params from query or hash, persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, container settings, and extended theme values.",
  "project_state.json": "Describes current project state, known issues, and pending feature requests related to fixing a Motoko text-normalization filter."
}