{
  "backend/main.mo": "Defines types for exercises, workouts, recovery, user profiles, and includes a static exercise library for backend workout generation.",
  "feature_evidence.json": "Feature evidence report placeholder with an empty features array.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for all frontend source files including pages, components, hooks, and styling.",
  "frontend/DEPLOY_RETRY.md": "Deployment retry log documenting backend fixes, especially muscle‑group filter corrections and workout generation repairs.",
  "frontend/index.html": "Main HTML entry with PWA metadata, splash screens, manifest links, and root mount point.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, theme colors, and display settings.",
  "frontend/src/App.tsx": "Top‑level React app handling authentication, routing between pages, and validation for generated workouts.",
  "frontend/src/components/BodyweightModal.tsx": "Modal UI for updating bodyweight with validation and profile update mutation.",
  "frontend/src/components/BottomNav.tsx": "Renders a bottom navigation bar with tabs and a settings modal, handling vibration and navigation events.",
  "frontend/src/components/ExerciseChangeModal.tsx": "Shows a modal listing alternative exercises and records selected exercise changes to the backend.",
  "frontend/src/components/Header.tsx": "Displays the app header with branding, settings access, and logout handling.",
  "frontend/src/components/ProfileLoadingScreen.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/PullToRefresh.tsx": "Implements custom pull-to-refresh behavior with touch handling and animated indicator.",
  "frontend/src/components/RecoveryHeatmap.tsx": "Fetches and displays muscle recovery data with colored indicators and optional weighted leg averages.",
  "frontend/src/components/SettingsModal.tsx": "Provides a settings modal for editing user profile fields and saving updates to the backend.",
  "frontend/src/components/SplashScreen.tsx": "Shows an animated splash screen with app branding during startup.",
  "frontend/src/components/StatusBar.tsx": "Displays a sticky status bar showing the user's streak and today's date.",
  "frontend/src/components/WorkoutShareModal.tsx": "Modal component that generates share links and QR codes for workouts with copy and native share support.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useBackendActor.ts": "Empty placeholder file.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handles login, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks and helpers for backend operations with validation, error handling, and toast notifications.",
  "frontend/src/hooks/useWakeLock.ts": "Hook that manages screen wake lock with auto-reacquisition, error handling, and visibility event support.",
  "frontend/src/index.css": "Global Tailwind-based dark theme styling with system fonts, safe areas, and mobile optimizations.",
  "frontend/src/lib/profileCache.ts": "Empty module for future profile caching logic.",
  "frontend/src/lib/sessionStorage.ts": "Provides utilities to save, load, clear, and check active workout sessions in sessionStorage with 24‑hour expiry.",
  "frontend/src/lib/timestampUtils.ts": "Converts nanosecond timestamps to milliseconds, validates ranges, and formats timestamps into readable dates.",
  "frontend/src/lib/workoutPreviewSections.ts": "Builds ordered workout sections by muscle group, including leg subsections and handling unexpected groups.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing workout history, recovery data, and user metrics with refresh logic and timestamp formatting.",
  "frontend/src/pages/HistoryPage.tsx": "Displays past workouts with date formatting, volume conversion, and a calendar view of trained days.",
  "frontend/src/pages/LoginPage.tsx": "Login screen allowing authentication via Internet Identity with a branded UI and feature highlights.",
  "frontend/src/pages/NewWorkoutPage.tsx": "UI for selecting a workout type and triggering workout generation via query hooks.",
  "frontend/src/pages/OnboardingPage.tsx": "Form page for creating and saving a user profile with validation and backend mutation.",
  "frontend/src/pages/ProgressPage.tsx": "Displays recovery state and weekly muscle group volume with refresh capability.",
  "frontend/src/pages/SharedWorkoutPage.tsx": "Empty placeholder page for shared workout functionality.",
  "frontend/src/pages/WorkoutPreviewPage.tsx": "Validates and previews a generated workout, supports regenerating and changing exercises.",
  "frontend/src/pages/WorkoutSessionPage.tsx": "Handles active workout sessions including timers, logging sets, PR detection, and exercise changes.",
  "frontend/src/types.ts": "Defines frontend-specific exercise, workout, recovery, and configuration types.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and cleaning parameters from hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining themes, custom colors, typography, animations, and container settings.",
  "project_state.json": "Project metadata tracking backend workout generator bugs, required fixes, and architectural notes for recovery logic and logging."
}