{
  "backend/main.mo": "Defines core workout, exercise, recovery, user profile, and error types along with a predefined exercise library for backend logic.",
  "feature_evidence.json": "Empty feature evidence report structure containing no listed features.",
  "frontend-file-summaries.txt": "Contains short summaries of all major frontend files including styles, pages, components, and hooks.",
  "frontend/DEPLOY_RETRY.md": "Logs deployment retry attempts and documents fixes applied to workout filtering and generation logic.",
  "frontend/index.html": "Base HTML template configuring PWA metadata, icons, splash screens, and loading the React app entry point.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, theme colors, and categories for Gym Tracker.",
  "frontend/src/App.tsx": "Main React application controller handling authentication flow, lazy‑loaded pages, navigation state, and workout validation.",
  "frontend/src/components/BodyweightModal.tsx": "Modal component for updating user bodyweight with validation, profile mutation, and UI controls for units and input.",
  "frontend/src/components/BottomNav.tsx": "Renders a bottom navigation bar with icons and opens the settings modal when selected.",
  "frontend/src/components/ExerciseChangeModal.tsx": "Displays alternative exercises and records selected exercise changes through backend mutations.",
  "frontend/src/components/Header.tsx": "Shows the top app header with branding, settings access, and logout functionality.",
  "frontend/src/components/ProfileLoadingScreen.tsx": "Placeholder file with no implemented content.",
  "frontend/src/components/PullToRefresh.tsx": "Implements a custom pull-to-refresh interaction using touch events and an animated indicator.",
  "frontend/src/components/RecoveryHeatmap.tsx": "Fetches and displays muscle recovery data with colored indicators and optional leg subgroup weighting.",
  "frontend/src/components/SettingsModal.tsx": "Provides a modal for editing and saving user profile settings including weight, preferences, and theme mode.",
  "frontend/src/components/SplashScreen.tsx": "Shows an animated splash screen with app branding during initial load.",
  "frontend/src/components/StatusBar.tsx": "Displays the user's workout streak and today's date in a sticky status bar.",
  "frontend/src/components/WorkoutShareModal.tsx": "Modal component that generates and displays a QR code and share link for a workout, supporting copy-to-clipboard and native sharing.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on the user's Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBackendActor.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, including login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks and helpers for backend interactions, including error parsing, workout validation, and profile defaults.",
  "frontend/src/hooks/useWakeLock.ts": "Hook providing robust screen wake lock management with automatic reacquisition, error handling, and visibility-state awareness.",
  "frontend/src/index.css": "Global Tailwind-based dark theme styling with Telegram-inspired colors, mobile optimizations, safe-area utilities, and font settings.",
  "frontend/src/lib/profileCache.ts": "Empty file with no content.",
  "frontend/src/lib/sessionStorage.ts": "Provides utilities to save, load, validate, and clear workout session state in sessionStorage with a 24‑hour expiration.",
  "frontend/src/lib/timestampUtils.ts": "Converts backend BigInt timestamps from nanoseconds to milliseconds and offers validation, Date conversion, and formatting helpers.",
  "frontend/src/lib/workoutPreviewSections.ts": "Groups exercises by muscle group and builds ordered workout sections, including structured leg subsections and fallback handling for unexpected groups.",
  "frontend/src/main.tsx": "Initializes the React app root and wraps it with React Query and Internet Identity providers.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the dashboard with workout history, recovery data, timestamps formatting, refresh handling, and navigation actions.",
  "frontend/src/pages/HistoryPage.tsx": "Displays past workouts with timestamp formatting, calendar highlighting, and pull‑to‑refresh using workout history data.",
  "frontend/src/pages/LoginPage.tsx": "Provides a styled login screen enabling authentication through Internet Identity with feature highlights.",
  "frontend/src/pages/NewWorkoutPage.tsx": "UI for selecting a workout type and triggering generation via query hooks, then returning the generated workout upstream.",
  "frontend/src/pages/OnboardingPage.tsx": "User profile setup form that validates inputs and saves profile data using a mutation hook.",
  "frontend/src/pages/ProgressPage.tsx": "Displays recovery status and weekly muscle group volume with refresh support using query data.",
  "frontend/src/pages/SharedWorkoutPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/WorkoutPreviewPage.tsx": "Validates and previews a generated workout, supports regenerating and changing exercises before starting a session.",
  "frontend/src/pages/WorkoutSessionPage.tsx": "Manages an active workout session including sets, timers, logs, exercise changes, and saving session data.",
  "frontend/src/types.ts": "Defines frontend-only types for exercises, workouts, recovery, and configuration structures.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Defines Tailwind config with custom colors, typography, container settings, animations, and extended theme values.",
  "project_state.json": "Describes the project’s backend state, known issues, and pending feature/refactor requests for the Motoko workout generator."
}