{
  "backend/main.mo": "Defines core types for workouts, recovery, user profiles, and exercise library, with logic placeholders and imports for authorization.",
  "feature_evidence.json": "Describes feature evidence for deploying a new draft build after backend filter fixes, listing related files, components, and tests.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend source files for documentation or build analysis.",
  "frontend/DEPLOY_RETRY.md": "Logs deployment retry attempts and documents fixes to backend muscle-group filtering syntax.",
  "frontend/index.html": "Sets up the PWA HTML shell including meta tags, icons, splash screens, and root app mount.",
  "frontend/public/manifest.json": "Defines PWA manifest metadata such as icons, theme, display mode, and categories.",
  "frontend/src/App.tsx": "Main React app managing authentication, routing, splash screen, workout generation validation, and lazy-loaded pages.",
  "frontend/src/components/BodyweightModal.tsx": "Modal for updating bodyweight with validation, unit selection, and profile update mutation.",
  "frontend/src/components/BottomNav.tsx": "Renders the bottom navigation bar with tabs and a settings modal, handling vibration and navigation events.",
  "frontend/src/components/ExerciseChangeModal.tsx": "Modal allowing users to select and record alternative exercises, fetching options and handling loading and errors.",
  "frontend/src/components/Header.tsx": "Displays the app header with branding, test mode badge, settings button, and logout functionality.",
  "frontend/src/components/ProfileLoadingScreen.tsx": "Empty component file with no implementation.",
  "frontend/src/components/PullToRefresh.tsx": "Implements touch-based pull‑to‑refresh behavior with custom resistance, indicators, and refresh handling.",
  "frontend/src/components/RecoveryHeatmap.tsx": "Displays muscle recovery data with loading states, color coding, and optional weighted leg recovery calculation.",
  "frontend/src/components/SettingsModal.tsx": "User settings modal for updating profile attributes, theme, and rest settings with validation and save logic.",
  "frontend/src/components/SplashScreen.tsx": "Full‑screen splash screen showing a dumbbell icon and app title during startup.",
  "frontend/src/components/StatusBar.tsx": "Top status bar displaying the user's workout streak and today's date.",
  "frontend/src/components/WorkoutShareModal.tsx": "React modal for sharing a workout via link, QR code, or native share, with clipboard copy and dynamic QR generation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendActor.ts": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading identities, handling login/logout, and exposing auth state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with the backend, including error handling, validation, and user profile defaults.",
  "frontend/src/hooks/useWakeLock.ts": "Implements a robust wake‑lock hook that acquires, maintains, and releases screen wake locks with auto‑reacquisition.",
  "frontend/src/index.css": "Global Tailwind‑based dark theme styles, system font settings, mobile optimizations, and UI utility classes.",
  "frontend/src/lib/profileCache.ts": "Empty file with no contents.",
  "frontend/src/lib/sessionStorage.ts": "Provides utilities to save, load, validate, and clear workout session state in sessionStorage with 24‑hour expiration.",
  "frontend/src/lib/timestampUtils.ts": "Converts backend nanosecond timestamps to milliseconds, validates ranges, and formats them into readable dates.",
  "frontend/src/lib/workoutPreviewSections.ts": "Groups exercises by muscle group and builds ordered workout sections, including detailed leg subsections.",
  "frontend/src/main.tsx": "Bootstraps the React app with react‑query and Internet Identity providers.",
  "frontend/src/pages/DashboardPage.tsx": "Displays workout history, recovery data, stats, and actions, with timestamp helpers and pull‑to‑refresh support.",
  "frontend/src/pages/HistoryPage.tsx": "Shows past workouts, calendar highlights, and volume/date formatting with refresh and timestamp conversion.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen using Internet Identity with branding, feature highlights, and a login button.",
  "frontend/src/pages/NewWorkoutPage.tsx": "UI for selecting workout type and generating workouts via query hooks, then sending results back to parent.",
  "frontend/src/pages/OnboardingPage.tsx": "Form that collects user profile data and saves it using a mutation with basic validation.",
  "frontend/src/pages/ProgressPage.tsx": "Displays recovery status and weekly muscle group volume with refresh capability using query hooks.",
  "frontend/src/pages/SharedWorkoutPage.tsx": "Empty page placeholder with no implemented logic.",
  "frontend/src/pages/WorkoutPreviewPage.tsx": "Validates and displays a generated workout, supports regenerating or swapping exercises before starting the session.",
  "frontend/src/pages/WorkoutSessionPage.tsx": "Handles full workout session flow including set logging, timers, PR tracking, wake lock, and exercise changes.",
  "frontend/src/types.ts": "Defines frontend-only types for exercises, workouts, recovery data, volume tracking, and set configurations.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and cleaning them from hash-based routes.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, layout, typography, animations, and plugin setup.",
  "project_state.json": "Project metadata describing current state, issues, and a new feature request to fix Motoko filter syntax."
}