{
  "backend/main.mo": "Defines core workout, user profile, recovery tracking types, stable state, and constants for exercise libraries and muscle group limits in a Motoko actor.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend source files for build reference or documentation.",
  "frontend/DEPLOY_RETRY.md": "Documentation-only file used to trigger a rebuild after a failed deployment, with no code changes.",
  "frontend/index.html": "Main HTML entry for the PWA including meta tags, manifest links, Apple splash screens, and script bootstrap.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, display mode, and theme settings for Gym Tracker.",
  "frontend/src/App.tsx": "Root React component handling authentication flow, page routing, workout validation, splash screen, and lazy-loaded pages.",
  "frontend/src/components/BodyweightModal.tsx": "Modal for updating and validating user bodyweight and unit, integrating profile update mutations and UI feedback.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar with page switching, haptic feedback, and settings modal activation.",
  "frontend/src/components/ExerciseChangeModal.tsx": "Modal for selecting and recording alternative exercises, showing options and handling API mutation and UI feedback.",
  "frontend/src/components/Header.tsx": "Top navigation bar showing app branding, test mode badge, settings button, and logout handling.",
  "frontend/src/components/ProfileLoadingScreen.tsx": "Empty placeholder component file with no implementation.",
  "frontend/src/components/PullToRefresh.tsx": "Implements a custom touch-based pull-to-refresh wrapper with animated indicator and refresh triggering logic.",
  "frontend/src/components/RecoveryHeatmap.tsx": "Displays muscle recovery status using API data with loading skeletons, color coding, and optional weighted leg averages.",
  "frontend/src/components/SettingsModal.tsx": "User settings modal allowing profile updates, dark mode toggling, validation, and saving via API mutations.",
  "frontend/src/components/SplashScreen.tsx": "Full‑screen splash screen showing logo and branding animations during app startup.",
  "frontend/src/components/StatusBar.tsx": "Compact status bar showing workout streak and current date.",
  "frontend/src/components/WorkoutShareModal.tsx": "Modal for sharing workouts via QR code, link copying, or native share API with loading and feedback states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendActor.ts": "Empty file.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, managing identities, login state, and AuthClient initialization.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend interactions with helpers for error handling, auth checks, and workout validation.",
  "frontend/src/hooks/useWakeLock.ts": "Implements a wake lock hook that requests, maintains, and releases screen wake locks with auto-reacquisition and error handling.",
  "frontend/src/index.css": "Global Tailwind-based stylesheet enforcing dark mode, theme variables, typography, safe areas, and mobile optimizations.",
  "frontend/src/lib/profileCache.ts": "Empty file.",
  "frontend/src/lib/sessionStorage.ts": "Utility functions to save, load, clear, and validate persisted workout session state in sessionStorage.",
  "frontend/src/lib/timestampUtils.ts": "Utilities for converting, validating, and formatting backend BigInt timestamps into usable dates and formatted strings.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers, rendering the App component.",
  "frontend/src/pages/DashboardPage.tsx": "Displays workout history, recovery data, and user stats with refresh actions and lazy‑loaded components.",
  "frontend/src/pages/HistoryPage.tsx": "Shows workout history with formatted timestamps and a training calendar, supporting pull‑to‑refresh.",
  "frontend/src/pages/LoginPage.tsx": "Provides a login screen using Internet Identity with branding and feature highlights.",
  "frontend/src/pages/NewWorkoutPage.tsx": "Generates new workouts based on selected type, calling backend generators and returning results to the parent.",
  "frontend/src/pages/OnboardingPage.tsx": "Collects initial user profile data and saves it via backend mutation with validation and feedback.",
  "frontend/src/pages/ProgressPage.tsx": "Displays muscle recovery and weekly volume data with refresh support and visual indicators for each muscle group.",
  "frontend/src/pages/SharedWorkoutPage.tsx": "Empty file with no implemented logic.",
  "frontend/src/pages/WorkoutPreviewPage.tsx": "Validates and displays a generated workout, allowing regeneration and exercise replacement before starting a session.",
  "frontend/src/pages/WorkoutSessionPage.tsx": "Manages an active workout session with set logging, timers, exercise changes, PR detection, and session persistence.",
  "frontend/src/types.ts": "Defines frontend types for exercises, workouts, recovery states, volume, and set configurations.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, sizes, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Contains project state metadata and requirements to fix backend lower-body workout note logic and update frontend to render a Core subsection after leg groups."
}