{
  "backend/main.mo": "Defines the main Motoko actor with workout, exercise, recovery, and user profile types plus an embedded exercise library.",
  "backend/migration.mo": "Provides a migration module that maps an old actor state to a new actor state with unchanged fields.",
  "feature_evidence.json": "Contains metadata describing a feature removal with affected files, components, tests, and confidence level.",
  "frontend-file-summaries.txt": "Lists concise summaries of multiple frontend files and their roles in the application.",
  "frontend/DEPLOY_RETRY.md": "Logs deployment retry attempts documenting backend filter fixes and build triggers.",
  "frontend/index.html": "Provides the main HTML document with PWA configuration, meta tags, and app bootstrap.",
  "frontend/public/manifest.json": "Defines the PWA manifest with app metadata, icons, display mode, and theme settings.",
  "frontend/src/App.tsx": "Implements the root React component handling authentication flow, page routing, workout validation, and lazy-loaded pages.",
  "frontend/src/components/BodyweightModal.tsx": "Modal for updating the user's bodyweight and unit with validation and profile mutation.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar with tab buttons and a settings modal trigger.",
  "frontend/src/components/ExerciseChangeModal.tsx": "Modal for selecting and recording an alternative exercise, fetching recommendations and updating backend.",
  "frontend/src/components/Header.tsx": "App header with branding, settings button, and logout handling.",
  "frontend/src/components/ProfileLoadingScreen.tsx": "Empty placeholder component.",
  "frontend/src/components/PullToRefresh.tsx": "Implements custom pull‑to‑refresh gesture with touch handling and refresh callback.",
  "frontend/src/components/RecoveryHeatmap.tsx": "Displays muscle recovery data with loading states and optional weighted leg average.",
  "frontend/src/components/SettingsModal.tsx": "Modal for editing and saving user profile settings such as gender, bodyweight, units, dark mode, and rest intervals.",
  "frontend/src/components/SplashScreen.tsx": "Full‑screen animated splash screen showing a dumbbell icon and app title.",
  "frontend/src/components/StatusBar.tsx": "Sticky top bar displaying the user’s daily streak and today’s date.",
  "frontend/src/components/WorkoutShareModal.tsx": "Modal that generates a QR code and provides sharing and copy‑link options for a workout.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on the user’s identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useBackendActor.ts": "Empty placeholder file for a backend actor hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity authentication, including login, logout, and identity loading logic.",
  "frontend/src/hooks/useQueries.ts": "React‑query hooks for backend interactions, with default profile values, validation helpers, and detailed error handling.",
  "frontend/src/hooks/useWakeLock.ts": "Hook to manage the Screen Wake Lock API with automatic reacquisition, cleanup, and error handling.",
  "frontend/src/index.css": "Defines global Tailwind layers, enforced dark theme variables, mobile typography, safe-area utilities, and page interaction utilities.",
  "frontend/src/lib/profileCache.ts": "Empty file with no implemented logic.",
  "frontend/src/lib/sessionStorage.ts": "Provides utilities to save, load, validate, and clear workout session state in sessionStorage with a 24‑hour expiry.",
  "frontend/src/lib/timestampUtils.ts": "Utility functions for detecting nanosecond timestamps, validating ranges, and formatting dates with optional time.",
  "frontend/src/lib/workoutPreviewSections.ts": "Builds ordered workout sections from exercises, grouping major muscle groups and creating leg subsections.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider and imports global styles.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard UI showing history, recovery, and user stats with pull‑to‑refresh and nanosecond timestamp handling.",
  "frontend/src/pages/HistoryPage.tsx": "Displays full workout history with timestamp conversion, volume formatting, and a calendar of trained dates.",
  "frontend/src/pages/LoginPage.tsx": "Displays the FitTrack login screen with app branding, feature highlights, and an Internet Identity login button.",
  "frontend/src/pages/NewWorkoutPage.tsx": "Lets users choose a workout type and triggers workout generation via backend hooks, then returns the generated plan.",
  "frontend/src/pages/OnboardingPage.tsx": "Collects user profile details such as gender, weight, and training settings and saves them through a backend mutation.",
  "frontend/src/pages/ProgressPage.tsx": "Shows recovery status and weekly training volume using backend queries, with pull‑to‑refresh support and visual indicators.",
  "frontend/src/pages/SharedWorkoutPage.tsx": "Placeholder page with no implemented content.",
  "frontend/src/pages/WorkoutPreviewPage.tsx": "Validates and displays a generated workout, allows regenerating or changing exercises, and prepares users to start a session.",
  "frontend/src/pages/WorkoutSessionPage.tsx": "Manages an active workout session including sets, timers, logging, PR detection, exercise changes, and workout saving.",
  "frontend/src/types.ts": "Defines TypeScript interfaces for exercises, workouts, recovery data, and related frontend-only fitness tracking structures.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions to read, store, retrieve, and clear URL and session parameters for routing and state persistence.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugin usage for styling the frontend.",
  "project_state.json": "Stores project metadata, feature statuses, and pending requests related to removing TEST_RECOVERY_MODE logic."
}