{
  "backend/main.mo": "Defines core workout, exercise, recovery, and user profile types along with an exercise library and app-level constants. Contains no business logic beyond type declarations and static data.",
  "feature_evidence.json": "Feature evidence report linking a specific feature to affected frontend files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all frontend source files, including hooks, pages, components, and styling.",
  "frontend/DEPLOY_RETRY.md": "Deployment retry log used to trigger rebuilds and document retry attempts, including a noted leg-filter matching fix.",
  "frontend/index.html": "Main HTML entry defining metadata, PWA configuration, splash assets, and bootstrapping the React application.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, theme colors, display mode, and categories for installation.",
  "frontend/src/App.tsx": "Root React component handling authentication flow, page routing, splash timing, workout validation, and global UI state.",
  "frontend/src/components/BodyweightModal.tsx": "Modal allowing users to update and validate bodyweight and units with profile mutation and vibration feedback.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar with tab switching, vibration feedback, and an integrated settings modal trigger.",
  "frontend/src/components/ExerciseChangeModal.tsx": "Modal that lists alternative exercises, lets users select one, and records the change via backend mutation.",
  "frontend/src/components/Header.tsx": "Top navigation bar showing app branding, test mode badge, settings button, and logout handler.",
  "frontend/src/components/ProfileLoadingScreen.tsx": "Empty file with no implemented UI or logic.",
  "frontend/src/components/PullToRefresh.tsx": "Implements a custom mobile pull‑to‑refresh gesture with touch handlers and animated spinner.",
  "frontend/src/components/RecoveryHeatmap.tsx": "Displays muscle recovery percentages with badges, weighted leg averages, and fallback loading or empty states.",
  "frontend/src/components/SettingsModal.tsx": "Settings dialog allowing users to edit profile fields, dark mode, and rest timers, then save via API mutations.",
  "frontend/src/components/SplashScreen.tsx": "Full‑screen splash screen showing animated logo and app tagline.",
  "frontend/src/components/StatusBar.tsx": "Sticky status bar showing the user’s streak and today’s date.",
  "frontend/src/components/WorkoutShareModal.tsx": "Modal that generates a QR code and link for sharing workouts, with copy and native share support.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useBackendActor.ts": "Empty file.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and handling login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query operations for backend data, including error handling, validation utilities, and workout-related helpers.",
  "frontend/src/hooks/useWakeLock.ts": "Implements a wake‑lock hook that prevents screen dimming, auto‑reacquires locks, and handles browser support and errors.",
  "frontend/src/index.css": "Tailwind‑based global stylesheet enforcing dark mode, system fonts, mobile optimizations, and safe‑area support.",
  "frontend/src/lib/profileCache.ts": "Empty file.",
  "frontend/src/lib/sessionStorage.ts": "Utilities for saving, loading, validating, and clearing workout session state in sessionStorage.",
  "frontend/src/lib/timestampUtils.ts": "Helpers for converting, validating, and formatting backend nanosecond timestamps into usable Date values and strings.",
  "frontend/src/lib/workoutPreviewSections.ts": "Groups exercises by muscle group, orders them using a fixed priority, and builds sections with leg subsections. Appends any other groups alphabetically.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context providers.",
  "frontend/src/pages/DashboardPage.tsx": "Displays workout history, recovery data, and user stats with refresh and lazy‑loaded components. Includes timestamp formatting, streak calculation, and volume helpers.",
  "frontend/src/pages/HistoryPage.tsx": "Shows past workouts with a calendar view, timestamp/volume formatting, and pull‑to‑refresh. Validates and converts nanosecond timestamps.",
  "frontend/src/pages/LoginPage.tsx": "Renders a styled login screen using Internet Identity with features overview and animated login button.",
  "frontend/src/pages/NewWorkoutPage.tsx": "Generates full, upper, or lower body workouts and triggers navigation after generation. Manages loading state and displays workout type cards.",
  "frontend/src/pages/OnboardingPage.tsx": "Captures initial user profile data and saves it via a mutation with validation and toasts. Provides form controls for gender, weight, units, and training settings.",
  "frontend/src/pages/ProgressPage.tsx": "Displays recovery status and weekly training volume with refresh support and UI cards. Fetches data via React Query and formats values based on user profile.",
  "frontend/src/pages/SharedWorkoutPage.tsx": "Empty file with no implemented logic.",
  "frontend/src/pages/WorkoutPreviewPage.tsx": "Validates and displays a generated workout, allows regenerating or changing exercises, and organizes sections based on workout type. Uses query hooks to regenerate workouts.",
  "frontend/src/pages/WorkoutSessionPage.tsx": "Manages live workout session flow including sets, timers, logging, weight updates, PR tracking, and persistence. Handles UI state, wake lock, and saving workout results.",
  "frontend/src/types.ts": "Defines frontend exercise, workout, recovery, and configuration data types extending backend interfaces.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, and clearing URL and session-based parameters for navigation and state persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending theme colors, typography, shadows, and animations with plugin support.",
  "project_state.json": "Defines project state and requests fixes for workout generation failures by adding default user profiles and bypassing blockers in test recovery mode. Lists active issues and feature requests targeting generation logic in backend/main.mo."
}