{
  "backend/main.mo": "Defines core workout, exercise, recovery, and user profile types plus an exercise library for backend logic.",
  "feature_evidence.json": "Contains evidence metadata linking features, files, components, and tests for a deployment-related requirement.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of many frontend source files and their functionality.",
  "frontend/DEPLOY_RETRY.md": "Logs deployment retry attempts and documents applied backend workout-generation fixes.",
  "frontend/index.html": "Base HTML file configuring PWA metadata, icons, splash screens, and loading the main React entrypoint.",
  "frontend/public/manifest.json": "Defines PWA manifest settings including app name, icons, theme, and display configuration.",
  "frontend/src/App.tsx": "Main React app container handling authentication flow, page routing, splash screen timing, and workout validation before navigation.",
  "frontend/src/components/BodyweightModal.tsx": "Modal component for updating bodyweight with validation and profile update mutation.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar with tab buttons and a settings modal trigger.",
  "frontend/src/components/ExerciseChangeModal.tsx": "Modal to select and record alternative exercises, fetching suggestions and updating backend.",
  "frontend/src/components/Header.tsx": "Header with app branding, settings button, and logout handling.",
  "frontend/src/components/ProfileLoadingScreen.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/PullToRefresh.tsx": "Custom pull‑to‑refresh wrapper implementing touch tracking and refresh indicators.",
  "frontend/src/components/RecoveryHeatmap.tsx": "Displays muscle recovery status with loading states and optional weighted leg recovery calculation.",
  "frontend/src/components/SettingsModal.tsx": "Settings modal for editing user profile fields, handling validation, saving, and dark mode toggling.",
  "frontend/src/components/SplashScreen.tsx": "Full‑screen splash screen showing an animated dumbbell and app title during app load.",
  "frontend/src/components/StatusBar.tsx": "Top status bar displaying the user's streak and today's date.",
  "frontend/src/components/WorkoutShareModal.tsx": "Modal that generates QR codes and share links for a workout and supports link copying and Web Share API.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the current identity and refreshes dependent queries.",
  "frontend/src/hooks/useBackendActor.ts": "Empty placeholder file for backend actor hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity provider and hook managing authentication, identity loading, login, and logout state.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for interacting with backend APIs, handling errors, validation, and profile defaults.",
  "frontend/src/hooks/useWakeLock.ts": "Hook implementing robust screen wake lock acquisition, release, and auto‑reacquisition with error handling.",
  "frontend/src/index.css": "Tailwind-based global dark theme styles, defining color variables, typography, mobile optimizations, and utility classes.",
  "frontend/src/lib/profileCache.ts": "Empty file with no implemented logic.",
  "frontend/src/lib/sessionStorage.ts": "Provides helpers to save, load, validate, clear, and check active workout sessions in sessionStorage.",
  "frontend/src/lib/timestampUtils.ts": "Utility functions to convert nanosecond timestamps, validate them, and format them into readable date strings.",
  "frontend/src/lib/workoutPreviewSections.ts": "Builds ordered workout sections from exercises, grouping by muscle group with special handling for leg subgroups.",
  "frontend/src/main.tsx": "React app entry point setting up React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page showing workout history, recovery data, and user metrics with refresh, formatting, and modal logic.",
  "frontend/src/pages/HistoryPage.tsx": "History page listing past workouts, date formatting, calendar highlighting, and refresh support.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with branding, feature highlights, and an Internet Identity login button.",
  "frontend/src/pages/NewWorkoutPage.tsx": "Lets users choose a workout type and triggers generation of full, upper, or lower body workouts.",
  "frontend/src/pages/OnboardingPage.tsx": "Collects initial user profile data such as gender, weight, rest times, and saves it to the backend.",
  "frontend/src/pages/ProgressPage.tsx": "Displays muscle recovery status and weekly volume data with refresh support.",
  "frontend/src/pages/SharedWorkoutPage.tsx": "Empty placeholder page with no implementation.",
  "frontend/src/pages/WorkoutPreviewPage.tsx": "Shows a generated workout, validates its structure, and allows regenerating or swapping exercises before starting.",
  "frontend/src/pages/WorkoutSessionPage.tsx": "Handles active workout tracking, including sets, timers, rest management, exercise changes, and saving session data.",
  "frontend/src/types.ts": "Defines TypeScript interfaces for exercises, workouts, recovery states, and related data used exclusively on the frontend.",
  "frontend/src/utils/urlParams.ts": "Provides functions to read, persist, and clear URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, breakpoints, animations, and plugin integrations.",
  "project_state.json": "Describes the project's state, known issues, and pending feature requests related to backend fixes and build processes."
}