{
  "backend/main.mo": "Main backend actor defining workout generation logic with exercise library, user profiles, recovery tracking, and workout history. Includes types for exercises, workouts, muscle recovery, user profiles, and error handling with access control integration.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including styling (Telegram dark theme), components (Header, Settings, Recovery Heatmap), pages (Dashboard, Workout Session, History), hooks (useQueries with backend operations), and validation logic for workouts and recovery data.",
  "frontend/DEPLOY_RETRY.md": "Deployment retry log documenting seven attempts to fix critical backend filter syntax bugs (invalid .toLower() method) and test mode recovery issues in workout generation functions, targeting draft versions 350-359+.",
  "frontend/index.html": "HTML entry point with PWA meta tags, manifest link, Apple touch icons, iOS splash screens, and viewport configuration for mobile-first standalone app experience.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata (name, icons, theme colors, display mode) for standalone installation with 192x192 and 512x512 icon sizes.",
  "frontend/src/App.tsx": "Main React app component managing authentication flow, page routing, workout state with comprehensive validation (empty workouts, duplicates, malformed data), lazy-loaded pages, bottom navigation, and splash screen.",
  "frontend/src/components/BodyweightModal.tsx": "Modal dialog for logging and updating user bodyweight with unit selection (kg/lb), input validation (0-500 range), and profile mutation integration with toast notifications.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar component with five tabs (Home, Workout, Progress, History, Settings) that handles page navigation, haptic feedback, and opens a settings modal.",
  "frontend/src/components/ExerciseChangeModal.tsx": "Modal dialog for changing exercises that fetches and displays alternative exercises for the same muscle group, records the change to the backend, and notifies the parent component.",
  "frontend/src/components/Header.tsx": "App header component displaying the FitTrack logo with settings and logout buttons that clear authentication and query cache on logout.",
  "frontend/src/components/ProfileLoadingScreen.tsx": "Empty file with no content.",
  "frontend/src/components/PullToRefresh.tsx": "Touch-based pull-to-refresh component that detects downward swipe gestures at the top of the page, shows a rotating refresh icon, and triggers a refresh callback with haptic feedback.",
  "frontend/src/components/RecoveryHeatmap.tsx": "Card component displaying muscle group recovery percentages with color-coded badges and progress bars, supporting optional weighted leg subgroup breakdown (quads, hamstrings, glutes, calves).",
  "frontend/src/components/SettingsModal.tsx": "Settings modal for configuring user profile including gender, bodyweight, weight unit, training frequency, dark mode, rest times, and muscle group rest intervals with validation and backend persistence.",
  "frontend/src/components/SplashScreen.tsx": "Full-screen splash screen with animated dumbbell icon and \"Gym Tracker\" branding displayed during app initialization.",
  "frontend/src/components/StatusBar.tsx": "Sticky top status bar showing the user's workout streak with a flame icon and the current date.",
  "frontend/src/components/WorkoutShareModal.tsx": "Modal component for sharing workouts via QR code, copy link, or native share API. Dynamically loads QRCode.js from CDN and generates a shareable URL for a given workout ID.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendActor.ts": "Empty file with no content.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout, identity persistence, and delegation validation. Provides status tracking and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend data operations including user profiles, workouts, exercises, and recovery states. Includes error handling for auth, delegation expiry, validation, and optimization errors.",
  "frontend/src/hooks/useWakeLock.ts": "React hook for managing Screen Wake Lock API to prevent screen dimming. Handles automatic re-acquisition on visibility change, browser support detection, and proper cleanup.",
  "frontend/src/index.css": "Global Tailwind CSS styles with Telegram 2025 dark theme colors enforced globally. Includes mobile optimizations, iOS safe area support, and native-style page transitions.",
  "frontend/src/lib/profileCache.ts": "Empty file with no content.",
  "frontend/src/lib/sessionStorage.ts": "Provides utilities to save, load, and clear workout session state in sessionStorage with a 24-hour expiration, preventing loss of workout progress on browser reload.",
  "frontend/src/lib/timestampUtils.ts": "Converts backend timestamps from nanoseconds to milliseconds, validates timestamp ranges, and formats timestamps into human-readable date/time strings.",
  "frontend/src/lib/workoutPreviewSections.ts": "Builds ordered workout sections from exercises, enforcing a specific muscle group order (Chest, Back, Shoulders, Arms, Legs with subgroups, Core) and handling unexpected groups alphabetically.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard displaying user stats, workout streak, recent workouts, recovery heatmap, and navigation to start workouts or view history/progress with pull-to-refresh support.",
  "frontend/src/pages/HistoryPage.tsx": "Displays workout history with a calendar view highlighting trained dates and a list of past workouts showing type, volume, and timestamp with pull-to-refresh.",
  "frontend/src/pages/LoginPage.tsx": "Landing page with branding and features that prompts users to authenticate using Internet Identity.",
  "frontend/src/pages/NewWorkoutPage.tsx": "Displays workout type selection cards (Full Body, Upper Body, Lower Body) with muscle group badges, duration, and exercise counts. Triggers workout generation mutations and passes generated workouts to parent via callback.",
  "frontend/src/pages/OnboardingPage.tsx": "Onboarding form collecting user profile data (gender, bodyweight, weight unit, training frequency, rest time, muscle group rest interval). Submits profile via useSaveCallerUserProfile mutation.",
  "frontend/src/pages/ProgressPage.tsx": "Displays muscle group recovery percentages with color-coded status bars and weekly training volume per muscle group. Includes pull-to-refresh functionality to invalidate and refetch recovery and volume queries.",
  "frontend/src/pages/SharedWorkoutPage.tsx": "Empty file with no content.",
  "frontend/src/pages/WorkoutPreviewPage.tsx": "Shows generated workout exercises organized into sections with sets/reps/weight, validates for duplicates and data integrity, and allows regeneration or individual exercise changes via modal before starting the workout session.",
  "frontend/src/pages/WorkoutSessionPage.tsx": "Active workout session page managing exercise progression, set logging with weight/reps inputs, rest timers (between sets and muscle groups), wake lock, session persistence, and workout completion with PR detection and confetti animations.",
  "frontend/src/types.ts": "Defines frontend TypeScript interfaces for Exercise, WorkoutExercise, Workout, RecoveryState, MuscleRecovery, SetData, and various tracking types (volume, intensity, history) used across the application.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including HSL-based color system, border radii, shadows, font sizes, and keyframe animations for accordion and other UI components.",
  "project_state.json": "Project state tracking document for a Motoko workout-generator backend, documenting recovery calculation bugs (adjustRecoveryForTestMode and calculateRecoveryPercentage using wrong time bases causing 0% recovery) and pending fixes for production hardening and recovery math."
}