{
  "backend/main.mo": "Defines the main actor with user profiles, workouts, recovery state types, exercise data, and test recovery mode flag.",
  "backend/migration.mo": "Implements state migration by mapping old actor fields to the new actor structure without altering data.",
  "feature_evidence.json": "Lists feature evidence entries describing workout preview ordering requirements with associated files, components, and tests.",
  "frontend-file-summaries.txt": "Provides short summaries of all frontend files, describing their purpose and key behaviors.",
  "frontend/DEPLOY_RETRY.md": "Tracks deployment retry attempts and notes a recent backend muscle-group matching fix.",
  "frontend/index.html": "Base HTML document configuring PWA metadata, icons, splash screens, and loading the React app.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, theme colors, icons, and categories.",
  "frontend/src/App.tsx": "Main React app controlling authentication flow, routing, workout generation validation, and page rendering.",
  "frontend/src/components/BodyweightModal.tsx": "Modal for updating the user's bodyweight with validation and profile update mutation.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar with tabs and a settings modal trigger, including vibration feedback.",
  "frontend/src/components/ExerciseChangeModal.tsx": "Modal to view and select alternative exercises, recording selections and updating the parent component.",
  "frontend/src/components/Header.tsx": "App header showing branding, test mode badge, settings button, and logout functionality.",
  "frontend/src/components/ProfileLoadingScreen.tsx": "Empty file placeholder for a profile loading screen component.",
  "frontend/src/components/PullToRefresh.tsx": "Custom pull-to-refresh wrapper implementing touch handling, resistance, and refresh animations.",
  "frontend/src/components/RecoveryHeatmap.tsx": "Component displaying muscle recovery status with loading states, badges, and optional weighted leg recovery.",
  "frontend/src/components/SettingsModal.tsx": "A modal for editing and saving user profile settings such as weight, dark mode, rest times, and training frequency using React state and backend mutations.",
  "frontend/src/components/SplashScreen.tsx": "Displays an animated full‑screen splash screen with a dumbbell icon and app title.",
  "frontend/src/components/StatusBar.tsx": "Shows a top status bar with current streak and today's date using simple UI layout.",
  "frontend/src/components/WorkoutShareModal.tsx": "A modal for sharing a workout via link, QR code, or native share API with copy and toast feedback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes queries when the actor changes.",
  "frontend/src/hooks/useBackendActor.ts": "Empty placeholder file for a backend actor hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an authentication context for managing Internet Identity login, identity persistence, and related state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend user profiles and workouts, including validation and detailed error handling.",
  "frontend/src/hooks/useWakeLock.ts": "Implements a robust hook for acquiring and maintaining screen wake lock with re-acquisition and error handling.",
  "frontend/src/index.css": "Defines global Tailwind layers, dark theme CSS variables, mobile typography, safe-area utilities, and system font settings.",
  "frontend/src/lib/profileCache.ts": "Empty file with no implemented logic.",
  "frontend/src/lib/sessionStorage.ts": "Provides utilities to save, load, clear, and check active workout sessions using sessionStorage with 24-hour expiry.",
  "frontend/src/lib/timestampUtils.ts": "Converts backend BigInt timestamps from nanoseconds to milliseconds and offers validation and formatting helpers.",
  "frontend/src/lib/workoutPreviewSections.ts": "Groups exercises by muscle group, enforcing a fixed order and leg subsections to build structured workout sections.",
  "frontend/src/main.tsx": "Initializes React app, wrapping it in query and identity providers and loading global styles.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the dashboard with workout history, recovery data, timestamp formatting, and pull-to-refresh support.",
  "frontend/src/pages/HistoryPage.tsx": "Displays workout history with date formatting, volume conversion, refresh logic, and a calendar view of training days.",
  "frontend/src/pages/LoginPage.tsx": "Renders a login screen using Internet Identity with branding, feature highlights, and a login button.",
  "frontend/src/pages/NewWorkoutPage.tsx": "Provides UI to select a workout type and generate a new workout using various generation hooks.",
  "frontend/src/pages/OnboardingPage.tsx": "Collects user profile data such as gender, weight, and training preferences and saves it via a mutation.",
  "frontend/src/pages/ProgressPage.tsx": "Displays muscle recovery status and weekly training volume with refresh support using query hooks.",
  "frontend/src/pages/SharedWorkoutPage.tsx": "Empty page placeholder for shared workout functionality.",
  "frontend/src/pages/WorkoutPreviewPage.tsx": "Validates and previews a generated workout, allowing exercise changes and regeneration before starting a session.",
  "frontend/src/pages/WorkoutSessionPage.tsx": "Manages an active workout session with set tracking, timers, exercise changes, persistence, and PR detection.",
  "frontend/src/types.ts": "Defines TypeScript interfaces for exercises, workouts, recovery state, and related data structures used solely on the frontend.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions for reading, writing, and clearing URL and sessionStorage parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, plugins, colors, typography, keyframes, and responsive container settings for the frontend.",
  "project_state.json": "Describes current project state, fixes needed, architectural notes, and known issues related to workout generation and frontend rendering."
}