{
  "backend/main.mo": "Defines the main backend actor with user profiles, workouts, recovery tracking, exercise library, and stable storage types.",
  "feature_evidence.json": "Empty feature-evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend source files for reference.",
  "frontend/DEPLOY_RETRY.md": "Documentation-only file used to force a rebuild after a failed deployment.",
  "frontend/index.html": "Main HTML entry for the PWA including meta tags, manifest links, splash screens, and root mounting element.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, theme settings, and display configuration.",
  "frontend/src/App.tsx": "Top-level React app handling authentication flow, page navigation, splash screen, and workout validation.",
  "frontend/src/components/BodyweightModal.tsx": "Modal component for updating and validating user bodyweight with profile mutation.",
  "frontend/src/components/BottomNav.tsx": "Mobile bottom navigation bar with page switching, vibration feedback, and integrated settings modal.",
  "frontend/src/components/ExerciseChangeModal.tsx": "Modal to display and select alternative exercises, record the selection, and notify the parent component.",
  "frontend/src/components/Header.tsx": "Header with app branding, test mode badge, settings button, and logout handler.",
  "frontend/src/components/ProfileLoadingScreen.tsx": "Empty placeholder component file.",
  "frontend/src/components/PullToRefresh.tsx": "Implements a custom pull-to-refresh interaction using touch events and animated UI feedback.",
  "frontend/src/components/RecoveryHeatmap.tsx": "Displays muscle recovery data with badges, colors, optional weighted leg averaging, and loading states.",
  "frontend/src/components/SettingsModal.tsx": "User settings modal allowing editing and saving profile fields such as gender, weight, dark mode, and rest intervals.",
  "frontend/src/components/SplashScreen.tsx": "Full-screen splash screen with animated logo and tagline.",
  "frontend/src/components/StatusBar.tsx": "Displays daily streak count and current date in a sticky status bar.",
  "frontend/src/components/WorkoutShareModal.tsx": "Modal to share workouts via link, QR code generation, clipboard copying, or native share API.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendActor.ts": "Empty file.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for managing Internet Identity login, stored identities, and AuthClient initialization.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks wrapping backend operations with error handling, workout validation, and user profile defaults.",
  "frontend/src/hooks/useWakeLock.ts": "Implements a wake‑lock hook that acquires, maintains, and re-acquires screen wake locks with robust error handling.",
  "frontend/src/index.css": "Global Tailwind-based dark theme styles with mobile optimizations, safe-area support, and UI utility classes.",
  "frontend/src/lib/profileCache.ts": "Empty file.",
  "frontend/src/lib/sessionStorage.ts": "Provides helpers to save, load, clear, and detect active workout sessions in sessionStorage with expiration logic.",
  "frontend/src/lib/timestampUtils.ts": "Utility functions to convert, validate, and format backend nanosecond timestamps into usable dates and strings.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider, rendering the main App component.",
  "frontend/src/pages/DashboardPage.tsx": "Displays user workout history, recovery data, and actions with refresh, navigation, and timestamp handling logic.",
  "frontend/src/pages/HistoryPage.tsx": "Shows past workouts with timestamp formatting, calendar highlights, and a refresh option.",
  "frontend/src/pages/LoginPage.tsx": "Provides the Internet Identity login interface with branding and status handling.",
  "frontend/src/pages/NewWorkoutPage.tsx": "Generates full, upper, or lower body workouts via hooks and lets users start a new session.",
  "frontend/src/pages/OnboardingPage.tsx": "Collects and saves initial user profile data including weight, gender, and training preferences.",
  "frontend/src/pages/ProgressPage.tsx": "Displays muscle recovery and weekly volume using query hooks, with refresh handling and UI cards for each muscle group.",
  "frontend/src/pages/SharedWorkoutPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/WorkoutPreviewPage.tsx": "Renders a workout preview with validation, regeneration, and exercise replacement flows before starting a session.",
  "frontend/src/pages/WorkoutSessionPage.tsx": "Runs the active workout session, tracking sets, timers, logs, PRs, and exercise changes with persistent session handling.",
  "frontend/src/types.ts": "Defines TypeScript interfaces for exercises, workouts, recovery, volume, and related frontend-only data structures.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL parameters with session persistence and hash routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugin usage.",
  "project_state.json": "Tracks project state, issues, and required backend/frontend fixes for workout generation and rendering. Highlights logic errors in lower-body workout creation and recovery-threshold problems causing missing leg exercises."
}