{
  "backend/main.mo": "Defines core workout, exercise, recovery, profile, and error types along with a built‑in exercise library and test recovery flag.",
  "feature_evidence.json": "Feature evidence report placeholder with an empty features array.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for frontend files describing styling, components, hooks, pages, and logic details.",
  "frontend/DEPLOY_RETRY.md": "Deployment retry log documenting manual deploy triggers and a backend leg-filter fix.",
  "frontend/index.html": "PWA‑enabled HTML entry file including meta tags, manifest links, touch icons, splash screens, and root mounting container.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, colors, and display settings for Gym Tracker.",
  "frontend/src/App.tsx": "Main React application controlling authentication flow, routing, splash screen, and workout validation before navigation.",
  "frontend/src/components/BodyweightModal.tsx": "Modal for logging and updating bodyweight with validation, unit selection, and profile update mutation.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar with vibrational feedback, page switching, and integrated settings modal.",
  "frontend/src/components/ExerciseChangeModal.tsx": "Modal to fetch and display alternative exercises, allowing users to select and record an exercise change.",
  "frontend/src/components/Header.tsx": "Top navigation bar showing app title, test mode badge, settings button, and logout functionality.",
  "frontend/src/components/ProfileLoadingScreen.tsx": "Empty component file with no implemented UI or logic.",
  "frontend/src/components/PullToRefresh.tsx": "Implements custom pull-to-refresh behavior with touch handling and a rotating refresh indicator.",
  "frontend/src/components/RecoveryHeatmap.tsx": "Displays muscle recovery status with color codes, badges, loading skeletons, and optional weighted leg recovery.",
  "frontend/src/components/SettingsModal.tsx": "Modal for editing and saving user profile settings like gender, weight, frequency, dark mode, and rest intervals.",
  "frontend/src/components/SplashScreen.tsx": "Full‑screen splash screen showing app branding with animated dumbbell icon and text.",
  "frontend/src/components/StatusBar.tsx": "Sticky status bar showing current streak count and today's date.",
  "frontend/src/components/WorkoutShareModal.tsx": "Modal that generates a QR code and link for sharing a workout, with copy and native share options.",
  "frontend/src/hooks/useActor.ts": "Provides a hook that creates and manages a backend actor tied to the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendActor.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing authentication state, loading identities, and handling login/logout via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks and utilities for backend data fetching, error handling, validation, and workout-related operations.",
  "frontend/src/hooks/useWakeLock.ts": "Provides a hook for managing the Screen Wake Lock API with automatic reacquisition, error handling, and visibility-based behavior.",
  "frontend/src/index.css": "Global Tailwind CSS file enforcing dark mode, theming variables, mobile optimizations, and system-style UI behaviors.",
  "frontend/src/lib/profileCache.ts": "Empty file with no implementation.",
  "frontend/src/lib/sessionStorage.ts": "Utility functions to save, load, validate, and clear workout session state in sessionStorage.",
  "frontend/src/lib/timestampUtils.ts": "Utility functions for converting, validating, and formatting backend BigInt timestamps into usable dates and strings.",
  "frontend/src/lib/workoutPreviewSections.ts": "Groups exercises by muscle group, orders them by a fixed sequence, and builds structured sections with leg subsections and alphabetical fallback groups.",
  "frontend/src/main.tsx": "Initializes React root and wraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/DashboardPage.tsx": "Displays workout history, recovery data, streaks, and refresh actions with lazy‑loaded components and timestamp handling.",
  "frontend/src/pages/HistoryPage.tsx": "Shows past workouts with date formatting, a calendar view, and pull‑to‑refresh using validated timestamp conversion.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen featuring Internet Identity authentication and themed UI elements.",
  "frontend/src/pages/NewWorkoutPage.tsx": "Lets users generate full, upper, or lower‑body workouts via query hooks and handle workflow navigation.",
  "frontend/src/pages/OnboardingPage.tsx": "Collects and validates initial user profile data before saving it through a mutation hook.",
  "frontend/src/pages/ProgressPage.tsx": "Displays recovery state and weekly muscle group volume with refresh support and styled UI cards.",
  "frontend/src/pages/SharedWorkoutPage.tsx": "Empty page placeholder with no implemented content.",
  "frontend/src/pages/WorkoutPreviewPage.tsx": "Validates and previews a generated workout, supports regenerating exercises and swapping individual exercises.",
  "frontend/src/pages/WorkoutSessionPage.tsx": "Handles live workout execution including set logging, timers, PR detection, exercise changes, and session persistence.",
  "frontend/src/types.ts": "Defines frontend-only TypeScript types for exercises, workouts, recovery state, and related data structures.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and responsive settings.",
  "project_state.json": "Metadata describing project state, issues, and a required backend fix for muscle group filtering."
}