{
  "kind": "build_request",
  "title": "Remove TEST_RECOVERY_MODE from backend and delete related frontend test-mode UI",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the TEST_RECOVERY_MODE flag and all TEST_RECOVERY/test-recovery logic from the Motoko backend, so workout generation always uses the normal recovery-based selection logic.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-7",
          "recent-9"
        ],
        "quotes": [
          "remove TEST_RECOVERY completely",
          "try again"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo no longer defines TEST_RECOVERY_MODE (or any equivalent test recovery toggle).",
        "Any conditional branches that force fixed exercise counts when TEST_RECOVERY_MODE is enabled are removed (e.g., the early return block in getExerciseCountForGroup).",
        "The backend compiles successfully and workout generation returns muscle-group-appropriate exercises without relying on any test-mode shortcut logic."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove any backend API surface used to expose test recovery mode status (e.g., an isTestRecoveryModeEnabled query) and update the generated frontend/backend bindings accordingly.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-7"
        ],
        "quotes": [
          "remove TEST_RECOVERY completely"
        ]
      },
      "acceptanceCriteria": [
        "If backend exposes a method such as isTestRecoveryModeEnabled(), it is removed from backend/main.mo.",
        "Frontend generated backend typings/build output no longer includes the removed method.",
        "No frontend code attempts to call a removed backend test-mode method at runtime."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove the frontend 'Test Mode' indicator and associated query/hook usage that checks test recovery mode status.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-7"
        ],
        "quotes": [
          "remove TEST_RECOVERY completely"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/hooks/useQueries.ts no longer exports useIsTestRecoveryModeEnabled (or any equivalent hook) and no longer queries ['testRecoveryMode'].",
        "frontend/src/components/Header.tsx no longer imports or calls useIsTestRecoveryModeEnabled, and the 'Test Mode' Badge is no longer rendered.",
        "The frontend builds successfully with no TypeScript errors related to removed test-mode APIs/hooks."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko architecture (all logic in backend/main.mo).",
    "Do not edit any files under frontend/src/components/ui or any paths listed in frontend immutablePaths (compose instead).",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Do not redesign the workout generation algorithm beyond removing the test recovery shortcut/toggle behavior.",
    "Do not add new features or settings related to test mode or developer toggles.",
    "Do not introduce new authentication methods beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}