{
  "kind": "build_request",
  "title": "Fix missing Core section in Lower Body preview and enforce global muscle-group display order",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Update the workout preview rendering in frontend/src/pages/WorkoutPreviewPage.tsx so that muscle-group sections are rendered in this exact top-level order when they have exercises: Chest → Back → Arms → Legs → Core.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Update the workout preview rendering so muscle groups ALWAYS display in this exact order when they have exercises: 1. Chest 2. Back 3. Arms 4. Legs ... 5. Core (after Legs)"
        ]
      },
      "acceptanceCriteria": [
        "Given any generated workout preview (Full Body, Upper Body, Lower Body, Lower Body + Core, and any other workout type), the UI renders muscle-group sections in this exact order when the group has at least one exercise: Chest, Back, Arms, Legs, Core.",
        "If one or more of the ordered groups has zero exercises, that group is omitted without affecting the relative order of the remaining groups."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Fix Lower Body workout preview rendering so that Legs is shown as a single top-level section that contains Quads, Hamstrings, Glutes, and Calves subsections (in that order) when those subgroups have exercises, and render the Core section after the Legs section when Core exercises exist.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Legs (top-level group with Quads/Hamstrings/Glutes/Calves subsections)",
          "Core (after Legs)"
        ]
      },
      "acceptanceCriteria": [
        "On a Lower Body (and Lower Body + Core) preview, Quads/Hamstrings/Glutes/Calves exercises are not rendered as separate top-level sections; they appear only under a single top-level \"Legs\" section.",
        "Within the \"Legs\" section, subsections appear in this order when present: Quads, Hamstrings, Glutes, Calves.",
        "If the workout contains any exercises where exercise.primaryMuscleGroup === \"Core\", a \"Core\" section is displayed after the \"Legs\" section; otherwise, Core is omitted.",
        "The Core section uses the exact JSX structure provided by the user (matching the existing style expectations) for listing Core exercises, including the suggestedWeight conditional and unit display logic."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Ensure any muscle groups not included in the required order (e.g., Shoulders or any unexpected groups returned by the backend) do not break ordering; render them only after Core in a stable, deterministic order.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "Workout previews never display any top-level muscle group before Chest or between the required ordered groups when those required groups are present.",
        "Any additional/unexpected muscle groups (if present) render after Core in a deterministic order (e.g., alphabetical), and the app does not crash."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Build and deploy a new draft containing the frontend workout preview fixes (Core visible in Lower Body + enforced muscle order) and report the newly created draft version number.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "FORCE APPLY + BUILD DRAFT: Fix Core missing in Lower Body + enforce muscle order"
        ]
      },
      "acceptanceCriteria": [
        "A new draft is successfully built and deployed with the updated frontend behavior.",
        "The response includes the new draft version number for review/testing."
      ]
    }
  ],
  "constraints": [
    "Do not change backend code for this request.",
    "Do not edit any files under frontend/src/components/ui (compose existing components only).",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx (immutable paths).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not modify workout generation logic or any backend muscle-group filtering/recovery logic.",
    "Do not change workout type selection UI or add new workout types.",
    "Do not change global styling/theme beyond what is necessary to implement the ordered grouping and Core visibility in the preview."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}