{
  "kind": "build_request",
  "title": "Fix Motoko filter syntax in buildShuffledSectionFromArray (draft 350 rebuild)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In backend/main.mo, update the filter inside buildShuffledSectionFromArray to remove the invalid Motoko method call e.primaryMuscleGroup.toLower() and replace the filter with exactly the following block:\n\nlet groupExercises = exercises.filter(func(e) {\n  Text.equal(\n    Text.toLowercase(e.primaryMuscleGroup),\n    Text.toLowercase(group)\n  )\n});\n\nKeep all existing Debug.print statements and all other logic in buildShuffledSectionFromArray unchanged.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The filter in buildShuffledSectionFromArray is invalid: e.primaryMuscleGroup.toLower() is not valid Motoko.\n\nReplace the filter with this exact block:\n\nlet groupExercises = exercises.filter(func(e) {\n  Text.equal(\n    Text.toLowercase(e.primaryMuscleGroup),\n    Text.toLowercase(group)\n  )\n});\n\nKeep all Debug.print statements and other logic unchanged."
        ]
      },
      "acceptanceCriteria": [
        "Project compiles successfully with the updated Motoko filter syntax (no usage of .toLower() on Text values).",
        "buildShuffledSectionFromArray uses Text.toLowercase and Text.equal exactly as provided for muscle-group matching.",
        "All pre-existing Debug.print statements in buildShuffledSectionFromArray remain present and unchanged.",
        "Generating a Full Body workout yields non-empty exercise selections across expected muscle groups (not only Core), assuming exercises exist in the library for those groups."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Produce and deploy a new draft build with version number 350 or higher after applying the backend filter fix.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Apply this change to the project and build a new draft (Version 350) NOW."
        ]
      },
      "acceptanceCriteria": [
        "A new draft is built and deployed with a version number >= 350.",
        "Deployed draft can be used to test generating a Full Body workout end-to-end from the UI."
      ]
    }
  ],
  "constraints": [
    "Do not change any logic in buildShuffledSectionFromArray other than replacing the invalid filter with the exact block provided by the user.",
    "Do not remove or modify any existing Debug.print statements.",
    "Respect the existing single-actor Motoko backend architecture (all logic remains in backend/main.mo).",
    "Do not modify files under frontend immutablePaths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui)."
  ],
  "nonGoals": [
    "No UI/UX redesign or new frontend features.",
    "No changes to workout section ordering logic beyond what is necessary for the filter fix.",
    "No schema/state migrations unless strictly required by compilation (not expected for this change)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}